src/cf/InformationRegisters/ХранимыеИзображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеИзображения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПривязки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Ошибка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Результат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеМодели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/_FinanceРаботаСИзображениямиСервер/Ext/Module.bsl
// Получает соответствие адресов из регистра хранимых изображений и их названий
//
//
// Возвращаемое значение:
//   Соответствие   - Соответствие с адресами пркрепленных изображений
//
&НаСервере
Функция ПолучитьПрикрепленныеИзображения(Объект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранимыеИзображения.Изображение КАК Изображение,
		|	ХранимыеИзображения.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ХранимыеИзображения КАК ХранимыеИзображения
		|ГДЕ
		|	ХранимыеИзображения.ОбъектПривязки = &Объект";
	
	Запрос.УстановитьПараметр("Объект",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		Соответствие = Новый Соответствие;			
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(ВыборкаДетальныеЗаписи.Номер,ВыборкаДетальныеЗаписи.Изображение.Получить());
	КонецЦикла;
	
	Возврат Соответствие;

КонецФункции 


// Создаёт запись в регистре ХранимыеИзображения
//
// Параметры:
//  ПутьКФайлу  - Строка - Путь к помещаемому файлу
//                 
//  СсылкаНаОбъект  - Ссылка - Ссылка на объект привязки
//                 
//
&НаСервере
Процедура ЗаписатьИзображениеВБазу(ПутьКФайлу,СсылкаНаОбъект) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ХранимыеИзображения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектПривязки.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Номер = ПолучитьНомерИзображения(СсылкаНаОбъект);
	Запись.ОбъектПривязки = СсылкаНаОбъект;
	Запись.Активность = Истина;
	Запись.Изображение = Новый  ХранилищеЗначения(Новый ДвоичныеДанные(ПутьКФайлу),Новый СжатиеДанных(9));
	НаборЗаписей.Записать();	

КонецПроцедуры // ()

// Получает последний порядковый номер изображения
//
// Параметры:
//  ОбъектПривязки  - составной - Ссылка на объект привязки
//
// Возвращаемое значение:
//   Число   - Номер последнего +1 изображения
//
&НаСервере
Функция ПолучитьНомерИзображения(ОбъектПривязки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранимыеИзображения.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ХранимыеИзображения КАК ХранимыеИзображения
		|ГДЕ
		|	ХранимыеИзображения.ОбъектПривязки = &ОбъектПривязки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("ОбъектПривязки", ОбъектПривязки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Номер + 1;
	КонецЦикла;
	
	Возврат 1;
	

КонецФункции // ()
// Позволяет интегрировать отображение хранимых изображений на форме
//
// Параметры:
//  Объект  - Ссылка - Ссылка на объект
//                 
//  Форма  - Форма - Форма, на которую необходимо добавить область изображений
//             
//
&НаСервере
Процедура ПриСозданииНаСервере(Объект,Форма) Экспорт 
	Если НЕ Объект.Ссылка.Пустая() Тогда	
		Изображения = ПолучитьПрикрепленныеИзображения(Объект.Ссылка);	
	КонецЕсли;
	
	Если НЕ	Изображения = Неопределено Тогда
		ОтобразитьИзображенияНаФорме(Изображения,Форма);			
	КонецЕсли;		
КонецПроцедуры // ()


#Область Служебные 

&НаСервере
Процедура ОтобразитьИзображенияНаФорме(Изображения,Форма)Экспорт 
	Для каждого Строка Из Изображения Цикл		
		ИмяРеквизита = "Картинка_" + Строка.Ключ ;
		Если НЕ _FinanceРаботаСИзображениямиСервер.РеквизитПисутствуетНаФорме(ИмяРеквизита,Форма) Тогда
			
			
			НовыйРевизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"));
			ДобавляемыйРеквизит    = Новый Массив;
			ДобавляемыйРеквизит.Добавить(НовыйРевизит);    
			Форма.ИзменитьРеквизиты(ДобавляемыйРеквизит);
			КартинкаПортрета = Форма.Элементы.Добавить("Картинка_" + Строка.Ключ , Тип("ПолеФормы"), Форма.Элементы.ГруппаИзображений);
			КартинкаПортрета.Вид = ВидПоляФормы.ПолеКартинки;
			КартинкаПортрета.ПутьКДанным = НовыйРевизит.Имя;
			КартинкаПортрета.РазмерКартинки = РазмерКартинки.Пропорционально;
			КартинкаПортрета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Низ;
			КартинкаПортрета.Заголовок = Строка.Ключ;    
			КартинкаПортрета.Гиперссылка = Истина;
			КартинкаПортрета.УстановитьДействие("Нажатие","ОбработкаНажатияНаКартинку");

			
			
		КонецЕсли;		
			Форма[ИмяРеквизита] = ПоместитьВоВременноеХранилище(Новый Картинка(Строка.Значение));
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры // ()



&НаСервере
Функция  РеквизитПисутствуетНаФорме(ИмяРеквизита,Форма) Экспорт 
	Для каждого СтрокаРеквизитов Из Форма.ПолучитьРеквизиты() Цикл		
		Если СтрокаРеквизитов.Имя = ИмяРеквизита Тогда
			Возврат Истина
		КонецЕсли
	КонецЦикла;
	Возврат Ложь;
КонецФункции // ()




&НаСервере
Функция ПолучитьРеквизитыФормыНаСервере(Форма)Экспорт 
	Возврат Форма.ПолучитьРеквизиты();
КонецФункции // ()


	
#КонецОбласти
